Repository: monroe-institute/polish-subtitles
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pl

source: 32 years ago that I first got into this field.
pl: 32 lata temu gdy po raz pierwszy wkroczyłem w ten obszar

source: 8 to 10 years earlier and Pudding, a picture to it.
pl: 8 do 10 lat wcześniej, i budyń, obraz do tego.

source: A new direction for our company.
pl: Nowy kierunek dla naszej firmy.

source: All over again, it was is this.
pl: I znów tak było.

source: And being very.
pl: I będąc bardzo

source: And in 1956, we had the choice.
pl: A w 1956 roku mieliśmy wybór

source: And knowing in.
pl: I wiedząc

source: And so we had started to do so.
pl: I zaczęliśmy to robić

source: And what we discovered was.
pl: Odkryliśmy,

source: Buck.
pl: dolara (zrzuceniu odpowiedzialności).

source: By accident sort of.
pl: Przez przypadek

source: Had at the time was.
pl: wtedy miałem, była

source: In American language, we have something that says the pass the
pl: w amerykańskim języku, mamy coś co mówi o podawaniu

source: In.
pl: w

source: Involved up until 1956.
pl: zaangażowana do 1956 roku

source: It took
pl: To zajęło

source: It was
pl: Było to

source: It was.
pl: To było

source: Like the monkey who fell out of the tree.
pl: Jak małpa, która spadła z drzewa.

source: My company, which I.
pl: Moja firma, którą

source: Of.
pl: czy

source: Professional in sound we naturally began to think of some
pl: profesjonalnymi w dźwięku naturalnie zaczęliśmy myśleć nad

source: So as the head of the company.
pl: Więc jako szef firmy

source: So.
pl: Więc

source: That, it was like seeing a
pl: że to było jak oglądanie

source: The Buck ends with the president of the company.
pl: Dolar kończy się na prezesie firmy.

source: The responsibility as does the authority so I decided we would
pl: Odpowiedzialność, podobnie jak władza, więc postanowiłem

source: There must be something better to do than to
pl: Musi być coś lepszego do roboty niż

source: This is where we came in
pl: Właśnie tam weszliśmy,

source: Until we discovered a very interesting thing now we had
pl: Dopóki nie odkryliśmy bardzo interesującej rzeczy, robiliśmy

source: Very extensive network radio programs, which means
pl: bardzo rozbudowane sieciowe programy radiowe, co oznacza

source: We did not think that we wanted to go through this all
pl: Nie sądziliśmy, że chcemy to wszystko powtarzać

source: Whether we converted all the way into television.
pl: przekształcić wszystko na telewizję

source: because we were taking exactly the same thing that we had done
pl: ponieważ robiliśmy dokładnie to samo, co zrobiliśmy

source: been doing these radio programs for many years.
pl: te programy radiowe od wielu lat.

source: dramatic programs for radio nationwide and overseas.
pl: programy dramatyczne dla radia w całym kraju i za granicą.

source: go into television and we have had already 2 quiz shows in
pl: wejście do telewizji. I mieliśmy już 2 programy quizowe

source: movie.
pl: filmu.

source: nothing more to US than radio
pl: dla nas nic więcej jak tylko radio

source: over again.
pl: od nowa

source: something better.
pl: coś lepszego.

source: television and found that this was nice but there must be
pl: w telewizji i stwierdziliśmy, że to było fajnie, ale musi być

source: try something else.
pl: że spróbujemy czegoś innego.

source: way to use sound.
pl: sposobami użycia dźwięku.

source: with a picture.
pl: z obrazem
